<details>
      <summary>📋 Terraform Plan Output (Part 3/3)</summary>
      
      ```
      ailability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-private-subnet-1"
          + "Project"     = "LeafWheels"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-private-subnet-1"
          + "Project"     = "LeafWheels"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-private-subnet-2"
          + "Project"     = "LeafWheels"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-private-subnet-2"
          + "Project"     = "LeafWheels"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-public-subnet-1"
          + "Project"     = "LeafWheels"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-public-subnet-1"
          + "Project"     = "LeafWheels"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-public-subnet-2"
          + "Project"     = "LeafWheels"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-public-subnet-2"
          + "Project"     = "LeafWheels"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-vpc"
          + "Project"     = "LeafWheels"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-vpc"
          + "Project"     = "LeafWheels"
        }
    }

Plan: 91 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name                    = (known after apply)
  + alb_zone_id                     = (known after apply)
  + backend_ecr_repository_url      = (known after apply)
  + cloudfront_domain_name          = (known after apply)
  + ecs_cluster_arn                 = (known after apply)
  + ecs_cluster_name                = "leafwheels-cluster"
  + ecs_task_execution_role_arn     = (known after apply)
  + ecs_task_role_arn               = (known after apply)
  + efs_file_system_id              = (known after apply)
  + frontend_ecr_repository_url     = (known after apply)
  + lex_bot_configuration           = {
      + bot_alias_id = "TSTALIASID"
      + bot_id       = (known after apply)
      + locale_id    = "en_US"
      + region       = "us-east-1"
    }
  + lex_bot_id                      = (known after apply)
  + lex_bot_name                    = "leafwheels-chatbot"
  + lex_test_alias_id               = "TSTALIASID"
  + postgres_service_discovery_name = "postgres.leafwheels.local"
  + redis_service_discovery_name    = "redis.leafwheels.local"
  + s3_bucket_arn                   = (known after apply)
  + s3_bucket_name                  = (known after apply)
  + vpc_id                          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
      ```
      
      </details>